Repository: Romain-Guillot/weather-app
Catalog: lib/resources/l10n/app_*.arb
Languages: bn, hi, ko, pt, th, vi

# appName
source: Weather app
bn: আবহাওয়া অ্যাপ
hi: मौसम ऐप
ko: 날씨 앱
pt: Aplicativo de clima
th: แอปพลิเคชันสภาพอากาศ
vi: Ứng dụng thời tiết

source: No place found
bn: কোন স্থান পাওয়া যায়নি
hi: कोई स्थान नहीं मिला
ko: 장소를 찾을 수 없습니다
pt: Nenhum lugar encontrado
th: ไม่พบสถานที่
vi: Không tìm thấy địa điểm

source: Loading...
bn: লোড হচ্ছে...
hi: लोड हो रहा है...
ko: 로딩 중...
pt: Carregando...
th: กำลังโหลด...
vi: Đang tải...

# locationSearchHint
source: Location
bn: অবস্থান
hi: स्थान
ko: 위치
pt: Localização
th: สถานที่
vi: Vị trí

source: Use current position
bn: বর্তমান অবস্থান ব্যবহার করুন
hi: वर्तमान स्थान का उपयोग करें
ko: 현재 위치 사용
pt: Usar posição atual
th: ใช้ตำแหน่งปัจจุบัน
vi: Sử dụng vị trí hiện tại

# searchHistoryLabel
source: History
bn: ইতিহাস
hi: इतिहास
ko: 기록
pt: Histórico
th: ประวัติศาสตร์
vi: Lịch sử

# weatherTabNow
source: Now
bn: এখন
hi: अभी
ko: 지금
pt: Agora
th: ตอนนี้
vi: Bây giờ

# weatherTabForecast
source: Forecast
bn: পূর্বাভাস
hi: अंदाज़ा
ko: 예보
pt: Previsão
th: พยากรณ์
vi: Dự báo

# temperatureFormattedValue
source: {temperature} Â°C
bn: {temperature} °C
hi: {temperature} °C
ko: {temperature} °C
pt: {temperature} °C
th: {temperature} °C
vi: {temperature} °C

# temperatureTitle
source: Temperature
bn: তাপমাত্রা
hi: तापमान
ko: 온도
pt: Temperatura
th: อุณหภูมิ
vi: Nhiệt độ

source: No history
bn: কোন ইতিহাস নেই
hi: कोई इतिहास नहीं
ko: 기록 없음
pt: Sem histórico
th: ไม่มีประวัติศาสตร์
vi: Không có lịch sử

# settingsDeveloperMode
source: Developer page
bn: উন্নয়নকারী পৃষ্ঠা
hi: डेवलपर पेज
ko: 개발자 페이지
pt: Página do desenvolvedor
th: หน้านักพัฒนา
vi: Trang nhà phát triển

# settingsLanguageTitle
source: Language
bn: ভাষা
hi: भाषा
ko: 언어
pt: Idioma
th: ภาษา
vi: Ngôn ngữ

# settingsAppSettings
source: Settings
bn: সেটিংস
hi: सेटिंग्स
ko: 설정
pt: Configurações
th: การตั้งค่า
vi: Cài đặt

# excUnableToShareWeather
source: Unable to share the current weather
bn: বর্তমান আবহাওয়া ভাগ করা যাবে না
hi: वर्तमान मौसम साझा नहीं किया जा सकता
ko: 현재 날씨를 공유할 수 없습니다
pt: Não é possível compartilhar o clima atual
th: ไม่สามารถแชร์สภาพอากาศปัจจุบันได้
vi: Không thể chia sẻ thời tiết hiện tại

source: Clear sky
bn: পরিষ্কার আকাশ
hi: साफ आकाश
ko: 맑은 하늘
pt: Céu limpo
th: ท้องฟ้าใส
vi: Bầu trời trong xanh

source: Partly cloudy
bn: আংশিকভাবে মেঘলা
hi: आंशिक ढेर
ko: 구름 조금
pt: Parcialmente nublado
th: มีเมฆบางส่วน
vi: Mây rải rác

source: Cloudy
bn: মেঘলা
hi: बादल छाए हुए
ko: 흐림
pt: Nublado
th: มีเมฆคลุมท้องฟ้า
vi: Âm u

source: Overcast
bn: মেঘলা
hi: बादल छाए हुए
ko: 흐림
pt: Nublado
th: มีเมฆครึ้ม
vi: Âm u

source: Fog
bn: কুয়াশা
hi: कोहरा
ko: 안개
pt: Nevoeiro
th: หมอก
vi: Sương mù

source: Depositing rime fog
bn: জমার উপর জমানো কুহু বসানো কুহু
hi: ठंडी धुंध जमाव जमाना
ko: 안개가 서리를 침전시킵니다
pt: Nevoeiro de geada depositando geada
th: หมอกที่เกิดการตกค้างของน้ำค้าง
vi: Sương mù kết tinh

source: Light drizzle
bn: হালকা ঝর্ণা
hi: हल्की बौछार
ko: 약한 이슬비
pt: Chuvisco leve
th: ฝนตกหนักเล็กน้อย
vi: Mưa phùn nhẹ

source: Moderate drizzle
bn: মাঝারি ঝর্ণা
hi: मध्यम बौछार
ko: 보통 이슬비
pt: Chuvisco moderado
th: ฝนตกเล็กน้อย
vi: Mưa phùn nhẹ

source: Dense drizzle
bn: ঘন ঝরঝরে বৃষ্টি
hi: घनी बौछार
ko: 짙은 이슬비
pt: Chuvisco denso
th: ฝนตกหนัก
vi: Mưa phùn đặc

source: Freezing light drizzle
bn: জমবারণকারী হালকা ঝরনা
hi: जमने वाली हल्की बौछार
ko: 결빙하는 가벼운 이슬비
pt: Chuvisco leve congelante
th: ฝนตกหนักแข็งเป็นน้ำแข็ง
vi: Mưa phùn nhẹ đóng băng khi tiếp xúc với bề mặt

# freezingMediumDrizzle
source: Freezing moderate drizzle
bn: ফ্রিজিং মধ্যম ঝরঝরে বৃষ্টি
hi: फ्रीजिंग मध्यम बौछार
ko: 동결하는 보통 이슬비
pt: Chuva congelante moderada
th: ฝนปรอทที่เป็นกลาง
vi: Mưa phùn đóng băng vừa phải

source: Slight rain
bn: হালকা বৃষ্টি
hi: हल्की बारिश
ko: 약한 비
pt: Chuva fraca
th: ฝนเล็กน้อย
vi: Mưa nhỏ

source: Moderate rain
bn: মাঝারি বৃষ্টি
hi: मध्यम वर्षा
ko: 보통 비
pt: Chuva moderada
th: ฝนตกปานกลาง
vi: Mưa vừa

source: Heavy rain
bn: ভারী বৃষ্টি
hi: भारी बारिश
ko: 폭우
pt: Chuva forte
th: ฝนตกหนัก
vi: Mưa to

source: Freezing light rain
bn: জমবারণযোগ্য হালকা বৃষ্টি
hi: जमने वाली हल्की बारिश
ko: 결빙하는 가벼운 비
pt: Chuva leve congelante
th: ฝนเล็กน้อยที่แข็งตัวเมื่อสัมผัสกับพื้นผิว
vi: Mưa nhẹ đóng băng khi tiếp xúc với bề mặt

source: Freezing heavy rain
bn: হিমবিন্দু ভরপুর বৃষ্টি
hi: जमाने वाली भारी बारिश
ko: 얼어붙는 폭우
pt: Chuva pesada congelante
th: ฝนตกหนักที่แข็งตัว
vi: Mưa đá lớn đóng băng

source: Slight snowfall
bn: হালকা তুষারপাত
hi: हल्की बर्फबारी
ko: 가벼운 눈
pt: Neve leve
th: หิมะตกเบาๆ
vi: Tuyết rơi nhẹ nhàng

source: Moderate snowfall
bn: মাঝামাঝি তুষারপাত
hi: मध्यम तूफानी बर्फबारी
ko: 적당한 눈 내림
pt: Neve moderada
th: หิมะตกปานกลาง
vi: Tuyết rơi vừa phải

source: Heavy snowfall
bn: ভারী তুষারপাত
hi: ज़ोरदार बर्फबारी
ko: 폭설
pt: Nevasca intensa
th: การตกหิมะหนัก
vi: Tuyết rơi dày đặc

source: Snow grains
bn: তুষার অনাজ
hi: हिम अनाज
ko: 눈송이
pt: Grãos de neve
th: เม็ดหิมะ
vi: Hạt tuyết

# slightRainShower
source: Slight rain showers
bn: হালকা বৃষ্টিপাত
hi: हल्की बारिश की झलक
ko: 약한 소나기
pt: Chuviscos leves
th: ฝนตกเล็กน้อย
vi: Mưa phùn nhẹ

# moderateRainShower
source: Moderate rain showers
bn: মাঝারি বৃষ্টি ঝড়
hi: मध्यम बारिश की झड़ें
ko: 보통 비
pt: Chuvas moderadas
th: ฝนตกปานกลาง
vi: Mưa vừa

source: Violent rain shower
bn: উত্তেজনাদায়ক বৃষ্টিপাত
hi: जोरदार बारिश शॉवर
ko: 강한 소나기
pt: Chuva forte
th: ฝนตกหนัก
vi: Mưa lớn

source: Slight snow showers
bn: হালকা তুষারপাত
hi: हल्की बर्फ की बौछारें
ko: 약한 눈
pt: Leves chuvas de neve
th: หิมะตกเล็กน้อย
vi: Mưa tuyết nhẹ

source: Heavy snow showers
bn: ভারী তুষারপাত
hi: जोरदार बर्फ की बौछारें
ko: 심한 눈 소나기
pt: Nevascas intensas
th: หิมะตกหนัก
vi: Tuyết rơi dày đặc

source: Thunderstorm
bn: বজ্রবৃষ্টি
hi: बिजली व बारिश से भरी तूफान
ko: 천둥번개 폭풍우
pt: Tempestade elétrica
th: พายุฟ้าคะนอง
vi: Sấm sét

# slightThunderstormWithHail
source: Thunderstorm with slight hail
bn: হাল্কা হেলিকপ্টার সহ বজ্রবৃষ্টি
hi: हल्के बारिश वाला तूफानी बादल
ko: 가벼운 우박을 동반한 천둥번개
pt: Trovoada com granizo leve
th: พายุฟ้าคะนองพร้อมกับลูกเห็บเล็กน้อย
vi: Sấm sét với mưa đá nhẹ

# heavyThunderstromWithHail
source: Thunderstorm with heavy hail
bn: ভারী হেইল সঙ্গে বজ্রপাতের ঝড়
hi: भारी हैल के साथ बिजली का तूफान
ko: 강한 우박을 동반한 천둥번개
pt: Tempestade com granizo pesado
th: พายุฟ้าคะนองพร้อมกับลูกเห็บหนัก
vi: Sấm sét kèm mưa đá nặng

# iconSettingsDescription
source: Wheater icons
bn: আবহাওয়া আইকন
hi: मौसम आइकन
ko: 날씨 아이콘
pt: Ícones do tempo
th: ไอคอนสภาพอากาศ
vi: Biểu tượng thời tiết
